CSI API ETABS v1
cPropFrame.GetSectProps Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSectProps(
	string Name,
	ref double Area,
	ref double As2,
	ref double As3,
	ref double Torsion,
	ref double I22,
	ref double I33,
	ref double S22,
	ref double S33,
	ref double Z22,
	ref double Z33,
	ref double R22,
	ref double R33
)
Function GetSectProps (
	Name As String,
	ByRef Area As Double,
	ByRef As2 As Double,
	ByRef As3 As Double,
	ByRef Torsion As Double,
	ByRef I22 As Double,
	ByRef I33 As Double,
	ByRef S22 As Double,
	ByRef S33 As Double,
	ByRef Z22 As Double,
	ByRef Z33 As Double,
	ByRef R22 As Double,
	ByRef R33 As Double
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim Area As Double
Dim As2 As Double
Dim As3 As Double
Dim Torsion As Double
Dim I22 As Double
Dim I33 As Double
Dim S22 As Double
Dim S33 As Double
Dim Z22 As Double
Dim Z33 As Double
Dim R22 As Double
Dim R33 As Double
Dim returnValue As Integer
returnValue = instance.GetSectProps(Name,
	Area, As2, As3, Torsion, I22, I33, S22,
	S33, Z22, Z33, R22, R33)
int GetSectProps(
	String^ Name,
	double% Area,
	double% As2,
	double% As3,
	double% Torsion,
	double% I22,
	double% I33,
	double% S22,
	double% S33,
	double% Z22,
	double% Z33,
	double% R22,
	double% R33
)
abstract GetSectProps :
        Name : string *
        Area : float byref *
        As2 : float byref *
        As3 : float byref *
        Torsion : float byref *
        I22 : float byref *
        I33 : float byref *
        S22 : float byref *
        S33 : float byref *
        Z22 : float byref *
        Z33 : float byref *
        R22 : float byref *
        R33 : float byref -> int
Parameters
Name
Type: System.String
Area
Type: System.Double
As2
Type: System.Double
As3
Type: System.Double
Torsion
Type: System.Double
I22
Type: System.Double
I33
Type: System.Double
S22
Type: System.Double
S33
Type: System.Double
Z22
Type: System.Double
Z33
Type: System.Double
R22
Type: System.Double
R33
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace